Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/trygderetten.no.csv-en-nn.deduped.tmx
Source language: en
Languages: nn

source: Has the National Insurance Court received my case?
nn: Har Trygderetten fått anken min?

source: Currently, the average case processing time is between 12 and 14 months.
nn: Per i dag ligg saksbehandlingstida i gjennomsnitt på 12 til 14 månader.

source: The National Insurance Court's orders and its interpretation of the law also provide guidance for NAV, Helseklage, public pension funds and others who apply social security and pension law.
nn: I tillegg vil dei kunne vere retningsgivande for NAV, Helseklage, offentlege pensjonsorningar og andre rettsbrukarar innanfor trygde- og pensjonsretten.

source: Career and vacancies
nn: Jobb i Trygderetten

source: If you disagree with a decision you have received from NAV Klageinstans, Helseklage or a pension fund (including SPK and KLP), you can normally appeal the decision to the National Insurance Court.
nn: Dersom du til dømes har søkt om dagpengar frå NAV Arbeid og ytingar og fått avslag, må du først klage på vedtaket til NAV Klageinstans.

source: An appeal can be submitted in writing and orally.
nn: Anke kan setjast fram skriftleg og munnleg.

source: Decisions adopted by NAV Klageinstans, Helseklage and a number of pension funds can be appealed to the National Insurance Court.
nn: Vedtak som NAV Klageinstans, Helseklage eller ein pensjonsordning har fatta om offentleg tenestepensjon, kan ankast til Trygderetten.

source: Do you wish to appeal a decision from NAV Klageinstans?
nn: Skal du anke eit vedtak frå NAV Klageinstans?

source: An appeal to the National Insurance Court must be submitted to the public authority (usually NAV Klageinstans) or insurance fund that made the decision.
nn: Ein anke til Trygderetten skal setjast fram for instansen som fatta det vedtaket ein ønskjer å få prøvd for Trygderetten (som regel NAV Klageinstans).

source: You can find more information in the National Insurance Act and its provisions on complaints and appeal in section 21‑12.
nn: Du finn meir informasjon om dette i trygderettslova og i føresegnene om klage og anke i trygdesaker i folketrygdlova § 21‑12.

source: Is the National Insurance Court part of NAV?
nn: Er Trygderetten ein del av NAV-systemet?

source: These can be found on NAV's website.
nn: Du finn desse på heimesidene til NAV.

source: An appeal to the National Insurance Court must be submitted to the public authority (usually NAV Klageinstans), or insurance fund, that made the decision you disagree with.
nn: Ein anke til Trygderetten skal normalt sett leverast til instansen (som regel NAV Klageinstans) som fatta vedtaket du er usamd i.

source: Do you wish to appeal a decision from Kommunal landspensjonskasse (KLP)?
nn: Skal du anke eit vedtak frå Kommunal landspensjonskasse (KLP)?

source: After the case has been received by the National Insurance Court, it can be contacted for any questions.
nn: Først etter at saka er komen til Trygderetten, kan Trygderetten kontaktast for eventuelle spørsmål.

source: You have received a decision from NAV Klageinstans, Helseklage, Statens pensjonskasse or another pension fund that you do not agree with.
nn: Du har fått eit vedtak frå NAV Klageinstans, Helseklage, Statens Pensjonskasse eller ein annan pensjonskasse som du ikkje er einig i.

source: Decisions from public occupational pensions by the Government Pension Fund (SPK) and the Municipal National Pension Fund (KLP) can also be appealed.
nn: Anke på vedtak om offentleg tenestepensjon skal leverast til Statens pensjonskasse (SPK), Kommunal landspensjonskasse (KLP) eller ei kommunal pensjonskasse, som deretter sender anken vidare til Trygderetten.

source: Please note that sensitive information should not be sent by e-mail.
nn: Vi gjer merksam på at sensitive opplysingar ikkje bør sendast per e-post.

source: This deadline is strict.
nn: Fristen blir praktisert strengt.
